PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v6.h
/***************************************************************************//**
* \file cyip_smif_v6.h
*
* \brief
* SMIF IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_SMIF_V6_H_
#define _CYIP_SMIF_V6_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                     SMIF
*******************************************************************************/

#define SMIF_CACHE_BLOCK_MMIO_SECTION_SIZE      0x00000080UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_SECTION_SIZE 0x00001000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_SECTION_SIZE 0x00001000UL
#define SMIF_CACHE_BLOCK_SECTION_SIZE           0x00010000UL
#define SMIF_CORE_SMIF_CRYPTO_SECTION_SIZE      0x00000080UL
#define SMIF_CORE_DEVICE_SECTION_SIZE           0x00000080UL
#define SMIF_CORE_AXI_MPC_SECTION_SIZE          0x00001000UL
#define SMIF_CORE_AXI_SECTION_SIZE              0x00001000UL
#define SMIF_CORE_SMIF_HSIOM_SMIF_PRT_SECTION_SIZE 0x00000010UL
#define SMIF_CORE_SMIF_HSIOM_SMIF_SECURE_PRT_SECTION_SIZE 0x00000010UL
#define SMIF_CORE_SMIF_HSIOM_SECTION_SIZE       0x00004000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_SECTION_SIZE 0x00000080UL
#define SMIF_CORE_SMIF_GPIO_SECTION_SIZE        0x00010000UL
#define SMIF_CORE_SECTION_SIZE                  0x00020000UL
#define SMIF_SECTION_SIZE                       0x00040000UL

/**
  * \brief MMIO regs for cacheblock (anything other than cache IP related MMIO regs) (SMIF_CACHE_BLOCK_MMIO)
  */
typedef struct
{
    __IOM uint32_t BYPASS_WI;                     /*!< 0x00000000 Bypass wrap to increment conversion logic */
    __IOM uint32_t MASTER_ID;                     /*!< 0x00000004 The cache generates transactions (linefill and eviction
                                                                Write-Back) that are marked with the value specified by
                                                                MASTER_ID on hmaster_m. */
    __IOM uint32_t DIS_CACHE_EN_MAINT;            /*!< 0x00000008 This signal turns on/off cache enable maintenance. */
    __IOM uint32_t DIS_CACHE_DIS_MAINT;           /*!< 0x0000000C This signal turns on/off cache disable maintenance. */
    __IOM uint32_t APB_VIOLATION_RESP;            /*!< 0x00000010 This signal controls if the APB interface of cache responds
                                                                with an error to illegal operations on the APB interface.
                                                                Illegal operations on the APB interface include Writing with no
                                                                full write strobe, Accessing non-word aligned addresses,
                                                                Instruction accesses, Non-privileged accesses 1 - The Cache
                                                                responds with an APB error. Read data is masked with zeros and
                                                                write data is ignored. 0 - The Cache sends an OK response. Read
                                                                data is masked with zeros and write data is ignored. */
    __IOM uint32_t MMIO_ACTIVE_EN;                /*!< 0x00000014 SW control to put SMIF.6 in active or clock gated mode */
    __IOM uint32_t POWER_ON_ENABLE;               /*!< 0x00000018 This signal configures the cache to enable the cache
                                                                automatically after powerup. */
    __IOM uint32_t MMIO_CACHE_RET_EN;             /*!< 0x0000001C Controls if cache SRAMs are retained during DPSLP */
    __IOM uint32_t DIS_PWR_DOWN_MAINT;            /*!< 0x00000020 This signal turns on/off powerdown maintenance. */
    __IOM uint32_t REGION0_BASE;                  /*!< 0x00000024 Region 0 Attributes - register 0; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IOM uint32_t REGION0_LIMIT;                 /*!< 0x00000028 Region 0 Attributes - register 1; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IOM uint32_t REGION1_BASE;                  /*!< 0x0000002C Region 1 Attributes - register 0; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IOM uint32_t REGION1_LIMIT;                 /*!< 0x00000030 Region 1 Attributes - register 1; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IOM uint32_t REGION2_BASE;                  /*!< 0x00000034 Region 2 Attributes - register 0; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IOM uint32_t REGION2_LIMIT;                 /*!< 0x00000038 Region 2 Attributes - register 1; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IOM uint32_t REGION3_BASE;                  /*!< 0x0000003C Region 3 Attributes - register 0; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IOM uint32_t REGION3_LIMIT;                 /*!< 0x00000040 Region 3 Attributes - register 1; Region attributes shall be
                                                                changed exclusively while the SMIF is disabled, and the XIP
                                                                interfaces are idle */
    __IM uint32_t RESERVED[15];
} SMIF_CACHE_BLOCK_MMIO_Type;                   /*!< Size = 128 (0x80) */

/**
  * \brief MPC Memory Protection Controller registers (SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC)
  */
typedef struct
{
    __IOM uint32_t CFG;                           /*!< 0x00000000 Config register with error response, RegionID PPC_MPC_MAIN is
                                                                the security owner PC. The error response configuration is
                                                                located in CFG.RESPONSE, only one such configuration exists
                                                                applying to all protection contexts in the system. */
    __IM uint32_t RESERVED[63];
    __IOM uint32_t CTRL;                          /*!< 0x00000100 Control register with lock bit and auto-increment only
                                                                (Separate CTRL for each PC depends on access_pc) */
    __IM uint32_t BLK_MAX;                       /*!< 0x00000104 Max value of block-based index register */
    __IM uint32_t BLK_CFG;                       /*!< 0x00000108 Block size & initialization in progress */
    __IOM uint32_t BLK_IDX;                       /*!< 0x0000010C Index of 32-block group accessed through BLK_LUT (Separate IDX
                                                                for each PC depending on access_pc) */
    __IOM uint32_t BLK_LUT;                       /*!< 0x00000110 NS status for 32 blocks at BLK_IDX with PC=<access_pc> */
    __IM uint32_t RESERVED1[59];
    __IOM uint32_t ROT_CTRL;                      /*!< 0x00000200 Control register with lock bit and auto-increment only */
    __IM uint32_t RESERVED2;
    __IM uint32_t ROT_BLK_MAX;                   /*!< 0x00000208 Max value of block-based index register for ROT */
    __IM uint32_t ROT_BLK_CFG;                   /*!< 0x0000020C Same as BLK_CFG */
    __IOM uint32_t ROT_BLK_IDX;                   /*!< 0x00000210 Index of 8-block group accessed through ROT_BLK_LUT_* */
    __IOM uint32_t ROT_BLK_PC;                    /*!< 0x00000214 Protection context of 8-block group accesses through
                                                                ROT_BLK_LUT */
    __IOM uint32_t ROT_BLK_LUT;                   /*!< 0x00000218 (R,W,NS) bits for 8 blocks at ROT_BLK_IDX for PC=ROT_BKL_PC */
    __IM uint32_t RESERVED3[889];
} SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_Type;       /*!< Size = 4096 (0x1000) */

/**
  * \brief SMIF Cacheblock MPC (SMIF_CACHE_BLOCK_CACHEBLK_AHB)
  */
typedef struct
{
    SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_Type MPC[1]; /*!< 0x00000000 MPC Memory Protection Controller registers */
} SMIF_CACHE_BLOCK_CACHEBLK_AHB_Type;           /*!< Size = 4096 (0x1000) */

/**
  * \brief Serial Memory Interface (SMIF_CACHE_BLOCK)
  */
typedef struct
{
    __IM uint32_t HWPARAMS;                      /*!< 0x00000000 Hardware Parameter register */
    __IM uint32_t RESERVED[3];
    __IOM uint32_t CTRL;                          /*!< 0x00000010 Control Register */
    __IM uint32_t NSEC_ACCESS;                   /*!< 0x00000014 Non-secure access information */
    __IM uint32_t RESERVED1[2];
    __OM uint32_t MAINT_CTRL_ALL;                /*!< 0x00000020 Maintenance control for the entire cache */
    __OM uint32_t MAINT_CTRL_LINES;              /*!< 0x00000024 Maintenance control for individual lines */
    __IM uint32_t MAINT_STATUS;                  /*!< 0x00000028 Maintenance status for the cache */
    __IM uint32_t RESERVED2[53];
    __IM uint32_t SECIRQSTAT;                    /*!< 0x00000100 Secure Interrupt Request Status register */
    __OM uint32_t SECIRQSCLR;                    /*!< 0x00000104 Secure Interrupt Status Clear register */
    __IOM uint32_t SECIRQEN;                      /*!< 0x00000108 Secure Interrupt Enable register */
    __IM uint32_t SECIRQINFO1;                   /*!< 0x0000010C Secure transfer error information 1 */
    __IM uint32_t SECIRQINFO2;                   /*!< 0x00000110 Secure transfer error information 2 */
    __IM uint32_t RESERVED3[11];
    __IM uint32_t NSECIRQSTAT;                   /*!< 0x00000140 Non-secure Interrupt Request Status register */
    __OM uint32_t NSECIRQSCLR;                   /*!< 0x00000144 Non-secure Interrupt Status Clear register */
    __IOM uint32_t NSECIRQEN;                     /*!< 0x00000148 Non-secure Interrupt Enable register */
    __IM uint32_t NSECIRQINFO1;                  /*!< 0x0000014C Non-secure transfer error information 1 */
    __IM uint32_t NSECIRQINFO2;                  /*!< 0x00000150 Non-secure transfer error information 2 */
    __IM uint32_t RESERVED4[107];
    __IM uint32_t SECHIT;                        /*!< 0x00000300 Secure transfers Hit register */
    __IM uint32_t SECMISS;                       /*!< 0x00000304 Secure transfers Miss register */
    __IOM uint32_t SECSTATCTRL;                   /*!< 0x00000308 Secure transfers statistic counters control */
    __IM uint32_t RESERVED5;
    __IM uint32_t NSECHIT;                       /*!< 0x00000310 Non-secure transfers Hit register */
    __IM uint32_t NSECMISS;                      /*!< 0x00000314 Non-secure transfers Miss register */
    __IOM uint32_t NSECSTATCTRL;                  /*!< 0x00000318 Non-secure transfers statistic counters control */
    __IM uint32_t RESERVED6[185];
    __IM uint32_t PMSVR0;                        /*!< 0x00000600 Saved Value Register 0 - Secure Hit */
    __IM uint32_t PMSVR1;                        /*!< 0x00000604 Saved Value Register 1 - Secure Miss */
    __IM uint32_t PMSVR2;                        /*!< 0x00000608 Saved Value Register 2 - Non-secure Hit */
    __IM uint32_t PMSVR3;                        /*!< 0x0000060C Saved Value Register 3 - Non-secure Miss */
    __IM uint32_t RESERVED7[28];
    __IM uint32_t PMSSSR;                        /*!< 0x00000680 PMU Snapshot Status Register */
    __IM uint32_t RESERVED8[27];
    __OM uint32_t PMSSCR;                        /*!< 0x000006F0 PMU Snapshot Capture Register */
    __IOM uint32_t PMSSRR;                        /*!< 0x000006F4 PMU Snapshot Reset Register */
    __IM uint32_t RESERVED9[566];
    __IM uint32_t PIDR4;                         /*!< 0x00000FD0 Peripheral ID 4 */
    __IM uint32_t PIDR5;                         /*!< 0x00000FD4 Peripheral ID 5 */
    __IM uint32_t PIDR6;                         /*!< 0x00000FD8 Peripheral ID 6 */
    __IM uint32_t PIDR7;                         /*!< 0x00000FDC Peripheral ID 7 */
    __IM uint32_t PIDR0;                         /*!< 0x00000FE0 Peripheral ID 0 */
    __IM uint32_t PIDR1;                         /*!< 0x00000FE4 Peripheral ID 1 */
    __IM uint32_t PIDR2;                         /*!< 0x00000FE8 Peripheral ID 2 */
    __IM uint32_t PIDR3;                         /*!< 0x00000FEC Peripheral ID 3 */
    __IM uint32_t CIDR0;                         /*!< 0x00000FF0 Component ID 0 */
    __IM uint32_t CIDR1;                         /*!< 0x00000FF4 Component ID 1 */
    __IM uint32_t CIDR2;                         /*!< 0x00000FF8 Component ID 2 */
    __IM uint32_t CIDR3;                         /*!< 0x00000FFC Component ID 3 */
    __IM uint32_t RESERVED10[1024];
    SMIF_CACHE_BLOCK_MMIO_Type MMIO;        /*!< 0x00002000 MMIO regs for cacheblock (anything other than cache IP related
                                                                MMIO regs) */
    __IM uint32_t RESERVED11[2016];
    SMIF_CACHE_BLOCK_CACHEBLK_AHB_Type CACHEBLK_AHB; /*!< 0x00004000 SMIF Cacheblock MPC */
    __IM uint32_t RESERVED12[11264];
} SMIF_CACHE_BLOCK_Type;                        /*!< Size = 65536 (0x10000) */

/**
  * \brief Cryptography registers (one set for each key) (SMIF_CORE_SMIF_CRYPTO)
  */
typedef struct
{
    __IOM uint32_t CRYPTO_CMD;                    /*!< 0x00000000 Cryptography command */
    __IOM uint32_t CRYPTO_ADDR;                   /*!< 0x00000004 Cryptography base address */
    __IOM uint32_t CRYPTO_MASK;                   /*!< 0x00000008 Cryptography mask */
    __IOM uint32_t CRYPTO_SUBREGION;              /*!< 0x0000000C Cryptography subregion disable */
    __IM uint32_t RESERVED[4];
    __IOM uint32_t CRYPTO_INPUT0;                 /*!< 0x00000020 Cryptography input 0 */
    __IOM uint32_t CRYPTO_INPUT1;                 /*!< 0x00000024 Cryptography input 1 */
    __IOM uint32_t CRYPTO_INPUT2;                 /*!< 0x00000028 Cryptography input 2 */
    __IOM uint32_t CRYPTO_INPUT3;                 /*!< 0x0000002C Cryptography input 3 */
    __IM uint32_t RESERVED1[4];
    __OM uint32_t CRYPTO_KEY0;                   /*!< 0x00000040 Cryptography key 0 */
    __OM uint32_t CRYPTO_KEY1;                   /*!< 0x00000044 Cryptography key 1 */
    __OM uint32_t CRYPTO_KEY2;                   /*!< 0x00000048 Cryptography key 2 */
    __OM uint32_t CRYPTO_KEY3;                   /*!< 0x0000004C Cryptography key 3 */
    __IM uint32_t RESERVED2[4];
    __IOM uint32_t CRYPTO_OUTPUT0;                /*!< 0x00000060 Cryptography output 0 */
    __IOM uint32_t CRYPTO_OUTPUT1;                /*!< 0x00000064 Cryptography output 1 */
    __IOM uint32_t CRYPTO_OUTPUT2;                /*!< 0x00000068 Cryptography output 2 */
    __IOM uint32_t CRYPTO_OUTPUT3;                /*!< 0x0000006C Cryptography output 3 */
    __IM uint32_t RESERVED3[4];
} SMIF_CORE_SMIF_CRYPTO_Type;                   /*!< Size = 128 (0x80) */

/**
  * \brief Device (only used for XIP acceses) (SMIF_CORE_DEVICE)
  */
typedef struct
{
    __IOM uint32_t CTL;                           /*!< 0x00000000 Control */
    __IM uint32_t RESERVED;
    __IOM uint32_t ADDR;                          /*!< 0x00000008 Device region base address */
    __IOM uint32_t MASK;                          /*!< 0x0000000C Device region mask */
    __IM uint32_t RESERVED1[4];
    __IOM uint32_t ADDR_CTL;                      /*!< 0x00000020 Address control */
    __IM uint32_t RESERVED2;
    __IOM uint32_t RX_CAPTURE_CONFIG;             /*!< 0x00000028 RX capture configuration */
    __IM uint32_t RESERVED3;
    __IM uint32_t RD_STATUS;                     /*!< 0x00000030 Read status */
    __IM uint32_t RESERVED4[3];
    __IOM uint32_t RD_CMD_CTL;                    /*!< 0x00000040 Read command control */
    __IOM uint32_t RD_ADDR_CTL;                   /*!< 0x00000044 Read address control */
    __IOM uint32_t RD_MODE_CTL;                   /*!< 0x00000048 Read mode control */
    __IOM uint32_t RD_DUMMY_CTL;                  /*!< 0x0000004C Read dummy control */
    __IOM uint32_t RD_DATA_CTL;                   /*!< 0x00000050 Read data control */
    __IOM uint32_t RD_CRC_CTL;                    /*!< 0x00000054 Read Bus CRC control */
    __IOM uint32_t RD_BOUND_CTL;                  /*!< 0x00000058 Read boundary control */
    __IM uint32_t RESERVED5;
    __IOM uint32_t WR_CMD_CTL;                    /*!< 0x00000060 Write command control */
    __IOM uint32_t WR_ADDR_CTL;                   /*!< 0x00000064 Write address control */
    __IOM uint32_t WR_MODE_CTL;                   /*!< 0x00000068 Write mode control */
    __IOM uint32_t WR_DUMMY_CTL;                  /*!< 0x0000006C Write dummy control */
    __IOM uint32_t WR_DATA_CTL;                   /*!< 0x00000070 Write data control */
    __IOM uint32_t WR_CRC_CTL;                    /*!< 0x00000074 Write Bus CRC control */
    __IOM uint32_t HB_FW_DEL_TAP_SEL_0;           /*!< 0x00000078 HB FW Calibration Delay Tap Select 0 */
    __IOM uint32_t HB_FW_DEL_TAP_SEL_1;           /*!< 0x0000007C HB FW Calibration Delay Tap Select 1 */
} SMIF_CORE_DEVICE_Type;                        /*!< Size = 128 (0x80) */

/**
  * \brief MPC Memory Protection Controller registers (SMIF_CORE_AXI_MPC)
  */
typedef struct
{
    __IOM uint32_t CFG;                           /*!< 0x00000000 Config register with error response, RegionID PPC_MPC_MAIN is
                                                                the security owner PC. The error response configuration is
                                                                located in CFG.RESPONSE, only one such configuration exists
                                                                applying to all protection contexts in the system. */
    __IM uint32_t RESERVED[63];
    __IOM uint32_t CTRL;                          /*!< 0x00000100 Control register with lock bit and auto-increment only
                                                                (Separate CTRL for each PC depends on access_pc) */
    __IM uint32_t BLK_MAX;                       /*!< 0x00000104 Max value of block-based index register */
    __IM uint32_t BLK_CFG;                       /*!< 0x00000108 Block size & initialization in progress */
    __IOM uint32_t BLK_IDX;                       /*!< 0x0000010C Index of 32-block group accessed through BLK_LUT (Separate IDX
                                                                for each PC depending on access_pc) */
    __IOM uint32_t BLK_LUT;                       /*!< 0x00000110 NS status for 32 blocks at BLK_IDX with PC=<access_pc> */
    __IM uint32_t RESERVED1[59];
    __IOM uint32_t ROT_CTRL;                      /*!< 0x00000200 Control register with lock bit and auto-increment only */
    __IM uint32_t RESERVED2;
    __IM uint32_t ROT_BLK_MAX;                   /*!< 0x00000208 Max value of block-based index register for ROT */
    __IM uint32_t ROT_BLK_CFG;                   /*!< 0x0000020C Same as BLK_CFG */
    __IOM uint32_t ROT_BLK_IDX;                   /*!< 0x00000210 Index of 8-block group accessed through ROT_BLK_LUT_* */
    __IOM uint32_t ROT_BLK_PC;                    /*!< 0x00000214 Protection context of 8-block group accesses through
                                                                ROT_BLK_LUT */
    __IOM uint32_t ROT_BLK_LUT;                   /*!< 0x00000218 (R,W,NS) bits for 8 blocks at ROT_BLK_IDX for PC=ROT_BKL_PC */
    __IM uint32_t RESERVED3[889];
} SMIF_CORE_AXI_MPC_Type;                       /*!< Size = 4096 (0x1000) */

/**
  * \brief Serial Memory Interface (SMIF_CORE_AXI)
  */
typedef struct
{
    SMIF_CORE_AXI_MPC_Type MPC[1];          /*!< 0x00000000 MPC Memory Protection Controller registers */
} SMIF_CORE_AXI_Type;                           /*!< Size = 4096 (0x1000) */

/**
  * \brief HSIOM port registers (SMIF_CORE_SMIF_HSIOM_SMIF_PRT)
  */
typedef struct
{
    __IOM uint32_t PORT_SEL0;                     /*!< 0x00000000 Port selection 0 */
    __IOM uint32_t PORT_SEL1;                     /*!< 0x00000004 Port selection 1 */
    __IM uint32_t RESERVED[2];
} SMIF_CORE_SMIF_HSIOM_SMIF_PRT_Type;           /*!< Size = 16 (0x10) */

/**
  * \brief HSIOM secure attribute port registers (SMIF_CORE_SMIF_HSIOM_SMIF_SECURE_PRT)
  */
typedef struct
{
    __IOM uint32_t NONSECURE_MASK;                /*!< 0x00000000 Non-Secure Mask */
    __IM uint32_t RESERVED[3];
} SMIF_CORE_SMIF_HSIOM_SMIF_SECURE_PRT_Type;    /*!< Size = 16 (0x10) */

/**
  * \brief IO Matrix (IOM) (SMIF_CORE_SMIF_HSIOM)
  */
typedef struct
{
    SMIF_CORE_SMIF_HSIOM_SMIF_PRT_Type SMIF_PRT[3]; /*!< 0x00000000 HSIOM port registers */
    __IM uint32_t RESERVED[1012];
    SMIF_CORE_SMIF_HSIOM_SMIF_SECURE_PRT_Type SMIF_SECURE_PRT[3]; /*!< 0x00001000 HSIOM secure attribute port registers */
    __IM uint32_t RESERVED1[1012];
    __IOM uint32_t AMUX_SPLIT_CTL[64];            /*!< 0x00002000 AMUX splitter cell control */
    __IM uint32_t RESERVED2[64];
    __IOM uint32_t MONITOR_CTL_0;                 /*!< 0x00002200 Power/Ground Monitor cell control 0 */
    __IOM uint32_t MONITOR_CTL_1;                 /*!< 0x00002204 Power/Ground Monitor cell control 1 */
    __IOM uint32_t MONITOR_CTL_2;                 /*!< 0x00002208 Power/Ground Monitor cell control 2 */
    __IOM uint32_t MONITOR_CTL_3;                 /*!< 0x0000220C Power/Ground Monitor cell control 3 */
    __IM uint32_t RESERVED3[1916];
} SMIF_CORE_SMIF_HSIOM_Type;                    /*!< Size = 16384 (0x4000) */

