PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v6.h
/**
  * \brief GPIO port registers (SMIF_CORE_SMIF_GPIO_SMIF_PRT)
  */
typedef struct
{
    __IOM uint32_t OUT;                           /*!< 0x00000000 Port output data register */
    __IOM uint32_t OUT_CLR;                       /*!< 0x00000004 Port output data clear register */
    __IOM uint32_t OUT_SET;                       /*!< 0x00000008 Port output data set register */
    __IOM uint32_t OUT_INV;                       /*!< 0x0000000C Port output data invert register */
    __IM uint32_t IN;                            /*!< 0x00000010 Port input state register */
    __IOM uint32_t INTR;                          /*!< 0x00000014 Port interrupt status register */
    __IOM uint32_t INTR_MASK;                     /*!< 0x00000018 Port interrupt mask register */
    __IM uint32_t INTR_MASKED;                   /*!< 0x0000001C Port interrupt masked status register */
    __IOM uint32_t INTR_SET;                      /*!< 0x00000020 Port interrupt set register */
    __IM uint32_t RESERVED[7];
    __IOM uint32_t INTR_CFG;                      /*!< 0x00000040 Port interrupt configuration register */
    __IOM uint32_t CFG;                           /*!< 0x00000044 Port configuration register */
    __IOM uint32_t CFG_IN;                        /*!< 0x00000048 Port input buffer configuration register */
    __IOM uint32_t CFG_OUT;                       /*!< 0x0000004C Port output buffer configuration register */
    __IOM uint32_t CFG_SIO;                       /*!< 0x00000050 Port SIO configuration register */
    __IM uint32_t RESERVED1;
    __IOM uint32_t CFG_IN_AUTOLVL;                /*!< 0x00000058 Port input buffer AUTOLVL configuration register for S40E GPIO */
    __IM uint32_t RESERVED2;
    __IOM uint32_t CFG_OUT2;                      /*!< 0x00000060 Port output buffer configuration register 2 */
    __IOM uint32_t CFG_SLEW_EXT;                  /*!< 0x00000064 Port output buffer slew extension configuration register */
    __IOM uint32_t CFG_DRIVE_EXT0;                /*!< 0x00000068 Port output buffer drive sel extension configuration register */
    __IOM uint32_t CFG_DRIVE_EXT1;                /*!< 0x0000006C Port output buffer drive sel extension configuration register */
    __IOM uint32_t CFG_OUT3;                      /*!< 0x00000070 Port output buffer configuration register 3 */
    __IOM uint32_t CFG_RES;                       /*!< 0x00000074 Port resistor configuration register 3 */
    __IOM uint32_t MSC_ANA;                       /*!< 0x00000078 Port MSCv3 AMUX enable */
    __IM uint32_t RESERVED3;
} SMIF_CORE_SMIF_GPIO_SMIF_PRT_Type;            /*!< Size = 128 (0x80) */

/**
  * \brief IO port control/configuration (SMIF_CORE_SMIF_GPIO)
  */
typedef struct
{
    SMIF_CORE_SMIF_GPIO_SMIF_PRT_Type SMIF_PRT[3]; /*!< 0x00000000 GPIO port registers */
    __IM uint32_t RESERVED[7072];
    __IM uint32_t SEC_INTR_CAUSE0;               /*!< 0x00007000 Secure Interrupt port cause register 0 */
    __IM uint32_t SEC_INTR_CAUSE1;               /*!< 0x00007004 Secure Interrupt port cause register 1 */
    __IM uint32_t SEC_INTR_CAUSE2;               /*!< 0x00007008 Secure Interrupt port cause register 2 */
    __IM uint32_t SEC_INTR_CAUSE3;               /*!< 0x0000700C Secure Interrupt port cause register 3 */
    __IM uint32_t RESERVED1[1020];
    __IM uint32_t INTR_CAUSE0;                   /*!< 0x00008000 Interrupt port cause register 0 */
    __IM uint32_t INTR_CAUSE1;                   /*!< 0x00008004 Interrupt port cause register 1 */
    __IM uint32_t INTR_CAUSE2;                   /*!< 0x00008008 Interrupt port cause register 2 */
    __IM uint32_t INTR_CAUSE3;                   /*!< 0x0000800C Interrupt port cause register 3 */
    __IM uint32_t VDD_ACTIVE;                    /*!< 0x00008010 Extern power supply detection register */
    __IOM uint32_t VDD_INTR;                      /*!< 0x00008014 Supply detection interrupt register */
    __IOM uint32_t VDD_INTR_MASK;                 /*!< 0x00008018 Supply detection interrupt mask register */
    __IM uint32_t VDD_INTR_MASKED;               /*!< 0x0000801C Supply detection interrupt masked register */
    __IOM uint32_t VDD_INTR_SET;                  /*!< 0x00008020 Supply detection interrupt set register */
    __IM uint32_t VDD_PWRSW_STATUS;              /*!< 0x00008024 Power switch status */
    __IM uint32_t RESERVED2[54];
    __IOM uint32_t VDD_PWRSW_CTL;                 /*!< 0x00008100 Power Switch control */
    __IM uint32_t RESERVED3[8127];
} SMIF_CORE_SMIF_GPIO_Type;                     /*!< Size = 65536 (0x10000) */

/**
  * \brief Serial Memory Interface (SMIF_CORE)
  */
typedef struct
{
    __IOM uint32_t CTL;                           /*!< 0x00000000 Control */
    __IM uint32_t STATUS;                        /*!< 0x00000004 Status */
    __IOM uint32_t CTL2;                          /*!< 0x00000008 Control 2 */
    __IM uint32_t RESERVED;
    __IM uint32_t DLP_DELAY_TAP_SEL0;            /*!< 0x00000010 DLP Delay Tap Select Register 0 */
    __IM uint32_t DLP_DELAY_TAP_SEL1;            /*!< 0x00000014 DLP Delay Tap Select Register 1 */
    __IOM uint32_t DLP_CTL;                       /*!< 0x00000018 DLP Control Register */
    __IM uint32_t RESERVED1;
    __IM uint32_t DLP_STATUS0;                   /*!< 0x00000020 DLP Status Register 0 */
    __IM uint32_t DLP_STATUS1;                   /*!< 0x00000024 DLP Status Register 1 */
    __IM uint32_t RESERVED2[7];
    __IM uint32_t TX_CMD_FIFO_STATUS;            /*!< 0x00000044 Transmitter command FIFO status */
    __IM uint32_t TX_CMD_MMIO_FIFO_STATUS;       /*!< 0x00000048 Transmitter command MMIO FIFO status */
    __IM uint32_t RESERVED3;
    __OM uint32_t TX_CMD_MMIO_FIFO_WR;           /*!< 0x00000050 Transmitter command MMIO FIFO write */
    __IM uint32_t RESERVED4[11];
    __IOM uint32_t TX_DATA_MMIO_FIFO_CTL;         /*!< 0x00000080 Transmitter data MMIO FIFO control */
    __IM uint32_t TX_DATA_FIFO_STATUS;           /*!< 0x00000084 Transmitter data FIFO status */
    __IM uint32_t TX_DATA_MMIO_FIFO_STATUS;      /*!< 0x00000088 Transmitter data MMIO FIFO status */
    __IM uint32_t RESERVED5;
    __OM uint32_t TX_DATA_MMIO_FIFO_WR1;         /*!< 0x00000090 Transmitter data MMIO FIFO write */
    __OM uint32_t TX_DATA_MMIO_FIFO_WR2;         /*!< 0x00000094 Transmitter data MMIO FIFO write */
    __OM uint32_t TX_DATA_MMIO_FIFO_WR4;         /*!< 0x00000098 Transmitter data MMIO FIFO write */
    __OM uint32_t TX_DATA_MMIO_FIFO_WR1ODD;      /*!< 0x0000009C Transmitter data MMIO FIFO write */
    __IM uint32_t RESERVED6[8];
    __IOM uint32_t RX_DATA_MMIO_FIFO_CTL;         /*!< 0x000000C0 Receiver data MMIO FIFO control */
    __IM uint32_t RX_DATA_MMIO_FIFO_STATUS;      /*!< 0x000000C4 Receiver data MMIO FIFO status */
    __IM uint32_t RX_DATA_FIFO_STATUS;           /*!< 0x000000C8 Receiver data FIFO status */
    __IM uint32_t RESERVED7;
    __IM uint32_t RX_DATA_MMIO_FIFO_RD1;         /*!< 0x000000D0 Receiver data MMIO FIFO read */
    __IM uint32_t RX_DATA_MMIO_FIFO_RD2;         /*!< 0x000000D4 Receiver data MMIO FIFO read */
    __IM uint32_t RX_DATA_MMIO_FIFO_RD4;         /*!< 0x000000D8 Receiver data MMIO FIFO read */
    __IM uint32_t RESERVED8;
    __IM uint32_t RX_DATA_MMIO_FIFO_RD1_SILENT;  /*!< 0x000000E0 Receiver data MMIO FIFO silent read */
    __IM uint32_t RESERVED9[7];
    __IOM uint32_t SLOW_CA_CTL;                   /*!< 0x00000100 Slow cache control */
    __IM uint32_t RESERVED10;
    __IOM uint32_t SLOW_CA_CMD;                   /*!< 0x00000108 Slow cache command */
    __IM uint32_t RESERVED11[29];
    __IOM uint32_t FAST_CA_CTL;                   /*!< 0x00000180 Fast cache control */
    __IM uint32_t RESERVED12;
    __IOM uint32_t FAST_CA_CMD;                   /*!< 0x00000188 Fast cache command */
    __IM uint32_t RESERVED13[29];
    SMIF_CORE_SMIF_CRYPTO_Type SMIF_CRYPTO_BLOCK[4]; /*!< 0x00000200 Cryptography registers (one set for each key) */
    __IM uint32_t RESERVED14[128];
    __IOM uint32_t CRC_CMD;                       /*!< 0x00000600 CRC Command */
    __IM uint32_t RESERVED15[7];
    __IOM uint32_t CRC_INPUT0;                    /*!< 0x00000620 CRC input 0 */
    __IOM uint32_t CRC_INPUT1;                    /*!< 0x00000624 CRC input 1 */
    __IM uint32_t RESERVED16[6];
    __IM uint32_t CRC_OUTPUT;                    /*!< 0x00000640 CRC output */
    __IM uint32_t RESERVED17[95];
    __IOM uint32_t INTR;                          /*!< 0x000007C0 Interrupt register */
    __IOM uint32_t INTR_SET;                      /*!< 0x000007C4 Interrupt set register */
    __IOM uint32_t INTR_MASK;                     /*!< 0x000007C8 Interrupt mask register */
    __IM uint32_t INTR_MASKED;                   /*!< 0x000007CC Interrupt masked register */
    __IM uint32_t RESERVED18[2];
    __IOM uint32_t DLL_IDAC;                      /*!< 0x000007D8 DLL IDAC ( when DLL runs in open loop, selects the delay of the
                                                                delay line) */
    __IOM uint32_t DLL_IVR;                       /*!< 0x000007DC DLL IVR (Contol Output Voltage of internal Voltage Regulator ) */
    __IM uint32_t RESERVED19[8];
    SMIF_CORE_DEVICE_Type DEVICE[4];        /*!< 0x00000800 Device (only used for XIP acceses) */
    __IM uint32_t RESERVED20[2432];
    SMIF_CORE_AXI_Type AXI;                 /*!< 0x00003000 Serial Memory Interface */
    SMIF_CORE_SMIF_HSIOM_Type SMIF_HSIOM;   /*!< 0x00004000 IO Matrix (IOM) */
    __IM uint32_t RESERVED21[8192];
    SMIF_CORE_SMIF_GPIO_Type SMIF_GPIO;     /*!< 0x00010000 IO port control/configuration */
} SMIF_CORE_Type;                               /*!< Size = 131072 (0x20000) */

/**
  * \brief SMIF subsystem (1 SMIF cores, no bridge, 1 cache_block and 1 Q_LPI expander) (SMIF_STRUCT)
  */
typedef struct
{
    __IM uint32_t RESERVED[16384];
    SMIF_CACHE_BLOCK_Type CACHE_BLOCK;      /*!< 0x00010000 Serial Memory Interface */
    SMIF_CORE_Type CORE;                    /*!< 0x00020000 Serial Memory Interface */
} SMIF_STRUCT_Type;                             /*!< Size = 262144 (0x40000) */


