PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v6.h
/* SMIF_CACHE_BLOCK_MMIO.BYPASS_WI */
#define SMIF_CACHE_BLOCK_MMIO_BYPASS_WI_BYPASS_WI_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_BYPASS_WI_BYPASS_WI_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.MASTER_ID */
#define SMIF_CACHE_BLOCK_MMIO_MASTER_ID_MASTER_ID_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_MASTER_ID_MASTER_ID_Msk 0xFFUL
/* SMIF_CACHE_BLOCK_MMIO.DIS_CACHE_EN_MAINT */
#define SMIF_CACHE_BLOCK_MMIO_DIS_CACHE_EN_MAINT_DIS_CACHE_EN_MAINT_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_DIS_CACHE_EN_MAINT_DIS_CACHE_EN_MAINT_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.DIS_CACHE_DIS_MAINT */
#define SMIF_CACHE_BLOCK_MMIO_DIS_CACHE_DIS_MAINT_DIS_CACHE_DIS_MAINT_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_DIS_CACHE_DIS_MAINT_DIS_CACHE_DIS_MAINT_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.APB_VIOLATION_RESP */
#define SMIF_CACHE_BLOCK_MMIO_APB_VIOLATION_RESP_APB_VIOLATION_RESP_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_APB_VIOLATION_RESP_APB_VIOLATION_RESP_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.MMIO_ACTIVE_EN */
#define SMIF_CACHE_BLOCK_MMIO_MMIO_ACTIVE_EN_MMIO_ACTIVE_EN_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_MMIO_ACTIVE_EN_MMIO_ACTIVE_EN_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.POWER_ON_ENABLE */
#define SMIF_CACHE_BLOCK_MMIO_POWER_ON_ENABLE_POWER_ON_ENABLE_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_POWER_ON_ENABLE_POWER_ON_ENABLE_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.MMIO_CACHE_RET_EN */
#define SMIF_CACHE_BLOCK_MMIO_MMIO_CACHE_RET_EN_MMIO_CACHE_RET_EN_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_MMIO_CACHE_RET_EN_MMIO_CACHE_RET_EN_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.DIS_PWR_DOWN_MAINT */
#define SMIF_CACHE_BLOCK_MMIO_DIS_PWR_DOWN_MAINT_DIS_PWR_DOWN_MAINT_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_DIS_PWR_DOWN_MAINT_DIS_PWR_DOWN_MAINT_Msk 0x1UL
/* SMIF_CACHE_BLOCK_MMIO.REGION0_BASE */
#define SMIF_CACHE_BLOCK_MMIO_REGION0_BASE_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION0_BASE_ADDR_Msk 0x7FFF000UL
/* SMIF_CACHE_BLOCK_MMIO.REGION0_LIMIT */
#define SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ENABLE_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ENABLE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ATTR_Pos 1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ATTR_Msk 0x3EUL
#define SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ADDR_Msk 0x7FFF000UL
/* SMIF_CACHE_BLOCK_MMIO.REGION1_BASE */
#define SMIF_CACHE_BLOCK_MMIO_REGION1_BASE_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION1_BASE_ADDR_Msk 0x7FFF000UL
/* SMIF_CACHE_BLOCK_MMIO.REGION1_LIMIT */
#define SMIF_CACHE_BLOCK_MMIO_REGION1_LIMIT_ENABLE_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_REGION1_LIMIT_ENABLE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION1_LIMIT_ATTR_Pos 1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION1_LIMIT_ATTR_Msk 0x3EUL
#define SMIF_CACHE_BLOCK_MMIO_REGION1_LIMIT_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION1_LIMIT_ADDR_Msk 0x7FFF000UL
/* SMIF_CACHE_BLOCK_MMIO.REGION2_BASE */
#define SMIF_CACHE_BLOCK_MMIO_REGION2_BASE_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION2_BASE_ADDR_Msk 0x7FFF000UL
/* SMIF_CACHE_BLOCK_MMIO.REGION2_LIMIT */
#define SMIF_CACHE_BLOCK_MMIO_REGION2_LIMIT_ENABLE_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_REGION2_LIMIT_ENABLE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION2_LIMIT_ATTR_Pos 1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION2_LIMIT_ATTR_Msk 0x3EUL
#define SMIF_CACHE_BLOCK_MMIO_REGION2_LIMIT_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION2_LIMIT_ADDR_Msk 0x7FFF000UL
/* SMIF_CACHE_BLOCK_MMIO.REGION3_BASE */
#define SMIF_CACHE_BLOCK_MMIO_REGION3_BASE_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION3_BASE_ADDR_Msk 0x7FFF000UL
/* SMIF_CACHE_BLOCK_MMIO.REGION3_LIMIT */
#define SMIF_CACHE_BLOCK_MMIO_REGION3_LIMIT_ENABLE_Pos 0UL
#define SMIF_CACHE_BLOCK_MMIO_REGION3_LIMIT_ENABLE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION3_LIMIT_ATTR_Pos 1UL
#define SMIF_CACHE_BLOCK_MMIO_REGION3_LIMIT_ATTR_Msk 0x3EUL
#define SMIF_CACHE_BLOCK_MMIO_REGION3_LIMIT_ADDR_Pos 12UL
#define SMIF_CACHE_BLOCK_MMIO_REGION3_LIMIT_ADDR_Msk 0x7FFF000UL


/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.CFG */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_CFG_RESPONSE_Pos 4UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_CFG_RESPONSE_Msk 0x10UL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.CTRL */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_CTRL_AUTO_INC_Pos 8UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_CTRL_AUTO_INC_Msk 0x100UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_CTRL_LOCK_Pos 31UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_CTRL_LOCK_Msk 0x80000000UL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.BLK_MAX */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_MAX_VALUE_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_MAX_VALUE_Msk 0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.BLK_CFG */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_CFG_BLOCK_SIZE_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_CFG_BLOCK_SIZE_Msk 0xFUL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_CFG_INIT_IN_PROGRESS_Pos 31UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_CFG_INIT_IN_PROGRESS_Msk 0x80000000UL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.BLK_IDX */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_IDX_VALUE_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_IDX_VALUE_Msk 0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.BLK_LUT */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS0_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS0_Msk 0x1UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS1_Pos 1UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS1_Msk 0x2UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS2_Pos 2UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS2_Msk 0x4UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS3_Pos 3UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS3_Msk 0x8UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS4_Pos 4UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS4_Msk 0x10UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS5_Pos 5UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS5_Msk 0x20UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS6_Pos 6UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS6_Msk 0x40UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS7_Pos 7UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS7_Msk 0x80UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS8_Pos 8UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS8_Msk 0x100UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS9_Pos 9UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS9_Msk 0x200UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS10_Pos 10UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS10_Msk 0x400UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS11_Pos 11UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS11_Msk 0x800UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS12_Pos 12UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS12_Msk 0x1000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS13_Pos 13UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS13_Msk 0x2000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS14_Pos 14UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS14_Msk 0x4000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS15_Pos 15UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS15_Msk 0x8000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS16_Pos 16UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS16_Msk 0x10000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS17_Pos 17UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS17_Msk 0x20000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS18_Pos 18UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS18_Msk 0x40000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS19_Pos 19UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS19_Msk 0x80000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS20_Pos 20UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS20_Msk 0x100000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS21_Pos 21UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS21_Msk 0x200000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS22_Pos 22UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS22_Msk 0x400000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS23_Pos 23UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS23_Msk 0x800000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS24_Pos 24UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS24_Msk 0x1000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS25_Pos 25UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS25_Msk 0x2000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS26_Pos 26UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS26_Msk 0x4000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS27_Pos 27UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS27_Msk 0x8000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS28_Pos 28UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS28_Msk 0x10000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS29_Pos 29UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS29_Msk 0x20000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS30_Pos 30UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS30_Msk 0x40000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS31_Pos 31UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_BLK_LUT_ATTR_NS31_Msk 0x80000000UL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.ROT_CTRL */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_CTRL_AUTO_INC_Pos 8UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_CTRL_AUTO_INC_Msk 0x100UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_CTRL_LOCK_Pos 31UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_CTRL_LOCK_Msk 0x80000000UL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.ROT_BLK_MAX */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_MAX_VALUE_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_MAX_VALUE_Msk 0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.ROT_BLK_CFG */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_CFG_BLOCK_SIZE_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_CFG_BLOCK_SIZE_Msk 0xFUL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Pos 31UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Msk 0x80000000UL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.ROT_BLK_IDX */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_IDX_VALUE_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_IDX_VALUE_Msk 0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.ROT_BLK_PC */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_PC_PC_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_PC_PC_Msk 0xFUL
/* SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC.ROT_BLK_LUT */
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR0_Pos 0UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR0_Msk 0x7UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR1_Pos 4UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR1_Msk 0x70UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR2_Pos 8UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR2_Msk 0x700UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR3_Pos 12UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR3_Msk 0x7000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR4_Pos 16UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR4_Msk 0x70000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR5_Pos 20UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR5_Msk 0x700000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR6_Pos 24UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR6_Msk 0x7000000UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR7_Pos 28UL
#define SMIF_CACHE_BLOCK_CACHEBLK_AHB_MPC_ROT_BLK_LUT_ATTR7_Msk 0x70000000UL


