PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v6.h
/* SMIF_CACHE_BLOCK.HWPARAMS */
#define SMIF_CACHE_BLOCK_HWPARAMS_ENDIANNESS_Pos 0UL
#define SMIF_CACHE_BLOCK_HWPARAMS_ENDIANNESS_Msk 0x3UL
#define SMIF_CACHE_BLOCK_HWPARAMS_XOM_Pos       2UL
#define SMIF_CACHE_BLOCK_HWPARAMS_XOM_Msk       0x4UL
#define SMIF_CACHE_BLOCK_HWPARAMS_SNAPSHOTTING_Pos 3UL
#define SMIF_CACHE_BLOCK_HWPARAMS_SNAPSHOTTING_Msk 0x8UL
#define SMIF_CACHE_BLOCK_HWPARAMS_CACHE_MEM_SIZE_Pos 8UL
#define SMIF_CACHE_BLOCK_HWPARAMS_CACHE_MEM_SIZE_Msk 0xFF00UL
#define SMIF_CACHE_BLOCK_HWPARAMS_MASTER_ID_Pos 16UL
#define SMIF_CACHE_BLOCK_HWPARAMS_MASTER_ID_Msk 0xFF0000UL
#define SMIF_CACHE_BLOCK_HWPARAMS_DIS_CACHE_EN_MAINT_Pos 24UL
#define SMIF_CACHE_BLOCK_HWPARAMS_DIS_CACHE_EN_MAINT_Msk 0x1000000UL
#define SMIF_CACHE_BLOCK_HWPARAMS_DIS_CACHE_DIS_MAINT_Pos 25UL
#define SMIF_CACHE_BLOCK_HWPARAMS_DIS_CACHE_DIS_MAINT_Msk 0x2000000UL
#define SMIF_CACHE_BLOCK_HWPARAMS_DIS_PWR_DOWN_MAINT_Pos 26UL
#define SMIF_CACHE_BLOCK_HWPARAMS_DIS_PWR_DOWN_MAINT_Msk 0x4000000UL
#define SMIF_CACHE_BLOCK_HWPARAMS_POWER_ON_ENABLE_Pos 27UL
#define SMIF_CACHE_BLOCK_HWPARAMS_POWER_ON_ENABLE_Msk 0x8000000UL
#define SMIF_CACHE_BLOCK_HWPARAMS_APB_VIOLATION_RESP_Pos 30UL
#define SMIF_CACHE_BLOCK_HWPARAMS_APB_VIOLATION_RESP_Msk 0x40000000UL
#define SMIF_CACHE_BLOCK_HWPARAMS_AHB_VIOLATION_RESP_Pos 31UL
#define SMIF_CACHE_BLOCK_HWPARAMS_AHB_VIOLATION_RESP_Msk 0x80000000UL
/* SMIF_CACHE_BLOCK.CTRL */
#define SMIF_CACHE_BLOCK_CTRL_ENABLE_Pos        0UL
#define SMIF_CACHE_BLOCK_CTRL_ENABLE_Msk        0x1UL
#define SMIF_CACHE_BLOCK_CTRL_FORCE_WT_Pos      1UL
#define SMIF_CACHE_BLOCK_CTRL_FORCE_WT_Msk      0x2UL
#define SMIF_CACHE_BLOCK_CTRL_DENY_POWERDOWN_Pos 8UL
#define SMIF_CACHE_BLOCK_CTRL_DENY_POWERDOWN_Msk 0x100UL
#define SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_ENABLE_READ_Pos 16UL
#define SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_ENABLE_READ_Msk 0x10000UL
#define SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_MAINT_LINES_Pos 17UL
#define SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_MAINT_LINES_Msk 0x20000UL
#define SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_NSECSTAT_Pos 18UL
#define SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_NSECSTAT_Msk 0x40000UL
/* SMIF_CACHE_BLOCK.NSEC_ACCESS */
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_CACHE_ENABLED_Pos 0UL
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_CACHE_ENABLED_Msk 0x1UL
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_NSEC_ENABLE_READ_ALLOWED_Pos 16UL
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_NSEC_ENABLE_READ_ALLOWED_Msk 0x10000UL
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_NSEC_MAINT_LINES_ALLOWED_Pos 17UL
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_NSEC_MAINT_LINES_ALLOWED_Msk 0x20000UL
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_NSEC_NSECSTAT_ALLOWED_Pos 18UL
#define SMIF_CACHE_BLOCK_NSEC_ACCESS_NSEC_NSECSTAT_ALLOWED_Msk 0x40000UL
/* SMIF_CACHE_BLOCK.MAINT_CTRL_ALL */
#define SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_CLEAN_ALL_Pos 0UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_CLEAN_ALL_Msk 0x1UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_INVALIDATE_ALL_Pos 1UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_INVALIDATE_ALL_Msk 0x2UL
/* SMIF_CACHE_BLOCK.MAINT_CTRL_LINES */
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_CLEAN_Pos 0UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_CLEAN_Msk 0x1UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_INVALIDATE_Pos 1UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_INVALIDATE_Msk 0x2UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY_Pos 2UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY_Msk 0x4UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_ADDR_Pos 5UL
#define SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_ADDR_Msk 0xFFFFFFE0UL
/* SMIF_CACHE_BLOCK.MAINT_STATUS */
#define SMIF_CACHE_BLOCK_MAINT_STATUS_CACHE_ENABLED_Pos 0UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_CACHE_ENABLED_Msk 0x1UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_EN_DIS_Pos 1UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_EN_DIS_Msk 0x2UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Pos 2UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Msk 0x4UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_PWR_MAINT_Pos 3UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_PWR_MAINT_Msk 0x8UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_CACHE_IS_CLEAN_Pos 8UL
#define SMIF_CACHE_BLOCK_MAINT_STATUS_CACHE_IS_CLEAN_Msk 0x100UL
/* SMIF_CACHE_BLOCK.SECIRQSTAT */
#define SMIF_CACHE_BLOCK_SECIRQSTAT_ENABLE_DONE_Pos 0UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_ENABLE_DONE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_DISABLE_DONE_Pos 1UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_DISABLE_DONE_Msk 0x2UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_MAINT_DONE_Pos 2UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_MAINT_DONE_Msk 0x4UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_MAINT_IGNORED_Pos 3UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_MAINT_IGNORED_Msk 0x8UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_TR_ERR_Pos  4UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_TR_ERR_Msk  0x10UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_SECURE_CNT_SAT_Pos 5UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_SECURE_CNT_SAT_Msk 0x20UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_NSECURE_CNT_SAT_Pos 6UL
#define SMIF_CACHE_BLOCK_SECIRQSTAT_NSECURE_CNT_SAT_Msk 0x40UL
/* SMIF_CACHE_BLOCK.SECIRQSCLR */
#define SMIF_CACHE_BLOCK_SECIRQSCLR_ENABLE_DONE_Pos 0UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_ENABLE_DONE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_DISABLE_DONE_Pos 1UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_DISABLE_DONE_Msk 0x2UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_MAINT_DONE_Pos 2UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_MAINT_DONE_Msk 0x4UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_MAINT_IGNORED_Pos 3UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_MAINT_IGNORED_Msk 0x8UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_TR_ERR_Pos  4UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_TR_ERR_Msk  0x10UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_SECURE_CNT_SAT_Pos 5UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_SECURE_CNT_SAT_Msk 0x20UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_NSECURE_CNT_SAT_Pos 6UL
#define SMIF_CACHE_BLOCK_SECIRQSCLR_NSECURE_CNT_SAT_Msk 0x40UL
/* SMIF_CACHE_BLOCK.SECIRQEN */
#define SMIF_CACHE_BLOCK_SECIRQEN_ENABLE_DONE_Pos 0UL
#define SMIF_CACHE_BLOCK_SECIRQEN_ENABLE_DONE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_SECIRQEN_DISABLE_DONE_Pos 1UL
#define SMIF_CACHE_BLOCK_SECIRQEN_DISABLE_DONE_Msk 0x2UL
#define SMIF_CACHE_BLOCK_SECIRQEN_MAINT_DONE_Pos 2UL
#define SMIF_CACHE_BLOCK_SECIRQEN_MAINT_DONE_Msk 0x4UL
#define SMIF_CACHE_BLOCK_SECIRQEN_MAINT_IGNORED_Pos 3UL
#define SMIF_CACHE_BLOCK_SECIRQEN_MAINT_IGNORED_Msk 0x8UL
#define SMIF_CACHE_BLOCK_SECIRQEN_TR_ERR_Pos    4UL
#define SMIF_CACHE_BLOCK_SECIRQEN_TR_ERR_Msk    0x10UL
#define SMIF_CACHE_BLOCK_SECIRQEN_SECURE_CNT_SAT_Pos 5UL
#define SMIF_CACHE_BLOCK_SECIRQEN_SECURE_CNT_SAT_Msk 0x20UL
#define SMIF_CACHE_BLOCK_SECIRQEN_NSECURE_CNT_SAT_Pos 6UL
#define SMIF_CACHE_BLOCK_SECIRQEN_NSECURE_CNT_SAT_Msk 0x40UL
/* SMIF_CACHE_BLOCK.SECIRQINFO1 */
#define SMIF_CACHE_BLOCK_SECIRQINFO1_ADDR_Pos   0UL
#define SMIF_CACHE_BLOCK_SECIRQINFO1_ADDR_Msk   0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.SECIRQINFO2 */
#define SMIF_CACHE_BLOCK_SECIRQINFO2_MASTER_Pos 0UL
#define SMIF_CACHE_BLOCK_SECIRQINFO2_MASTER_Msk 0xFFUL
#define SMIF_CACHE_BLOCK_SECIRQINFO2_ERROR_SRC_Pos 8UL
#define SMIF_CACHE_BLOCK_SECIRQINFO2_ERROR_SRC_Msk 0x300UL
/* SMIF_CACHE_BLOCK.NSECIRQSTAT */
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_MAINT_DONE_Pos 2UL
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_MAINT_DONE_Msk 0x4UL
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_MAINT_IGNORED_Pos 3UL
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_MAINT_IGNORED_Msk 0x8UL
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_TR_ERR_Pos 4UL
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_TR_ERR_Msk 0x10UL
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_NSECURE_CNT_SAT_Pos 6UL
#define SMIF_CACHE_BLOCK_NSECIRQSTAT_NSECURE_CNT_SAT_Msk 0x40UL
/* SMIF_CACHE_BLOCK.NSECIRQSCLR */
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_MAINT_DONE_Pos 2UL
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_MAINT_DONE_Msk 0x4UL
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_MAINT_IGNORED_Pos 3UL
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_MAINT_IGNORED_Msk 0x8UL
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_TR_ERR_Pos 4UL
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_TR_ERR_Msk 0x10UL
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_NSECURE_CNT_SAT_Pos 6UL
#define SMIF_CACHE_BLOCK_NSECIRQSCLR_NSECURE_CNT_SAT_Msk 0x40UL
/* SMIF_CACHE_BLOCK.NSECIRQEN */
#define SMIF_CACHE_BLOCK_NSECIRQEN_MAINT_DONE_Pos 2UL
#define SMIF_CACHE_BLOCK_NSECIRQEN_MAINT_DONE_Msk 0x4UL
#define SMIF_CACHE_BLOCK_NSECIRQEN_MAINT_IGNORED_Pos 3UL
#define SMIF_CACHE_BLOCK_NSECIRQEN_MAINT_IGNORED_Msk 0x8UL
#define SMIF_CACHE_BLOCK_NSECIRQEN_TR_ERR_Pos   4UL
#define SMIF_CACHE_BLOCK_NSECIRQEN_TR_ERR_Msk   0x10UL
#define SMIF_CACHE_BLOCK_NSECIRQEN_NSECURE_CNT_SAT_Pos 6UL
#define SMIF_CACHE_BLOCK_NSECIRQEN_NSECURE_CNT_SAT_Msk 0x40UL
/* SMIF_CACHE_BLOCK.NSECIRQINFO1 */
#define SMIF_CACHE_BLOCK_NSECIRQINFO1_ADDR_Pos  0UL
#define SMIF_CACHE_BLOCK_NSECIRQINFO1_ADDR_Msk  0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.NSECIRQINFO2 */
#define SMIF_CACHE_BLOCK_NSECIRQINFO2_MASTER_Pos 0UL
#define SMIF_CACHE_BLOCK_NSECIRQINFO2_MASTER_Msk 0xFFUL
#define SMIF_CACHE_BLOCK_NSECIRQINFO2_ERROR_SRC_Pos 8UL
#define SMIF_CACHE_BLOCK_NSECIRQINFO2_ERROR_SRC_Msk 0x300UL
/* SMIF_CACHE_BLOCK.SECHIT */
#define SMIF_CACHE_BLOCK_SECHIT_SECHITCNT_Pos   0UL
#define SMIF_CACHE_BLOCK_SECHIT_SECHITCNT_Msk   0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.SECMISS */
#define SMIF_CACHE_BLOCK_SECMISS_SECMISSCNT_Pos 0UL
#define SMIF_CACHE_BLOCK_SECMISS_SECMISSCNT_Msk 0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.SECSTATCTRL */
#define SMIF_CACHE_BLOCK_SECSTATCTRL_ENABLE_Pos 0UL
#define SMIF_CACHE_BLOCK_SECSTATCTRL_ENABLE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_SECSTATCTRL_RESET_Pos  1UL
#define SMIF_CACHE_BLOCK_SECSTATCTRL_RESET_Msk  0x2UL
/* SMIF_CACHE_BLOCK.NSECHIT */
#define SMIF_CACHE_BLOCK_NSECHIT_NSECHITCNT_Pos 0UL
#define SMIF_CACHE_BLOCK_NSECHIT_NSECHITCNT_Msk 0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.NSECMISS */
#define SMIF_CACHE_BLOCK_NSECMISS_NSECMISSCNT_Pos 0UL
#define SMIF_CACHE_BLOCK_NSECMISS_NSECMISSCNT_Msk 0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.NSECSTATCTRL */
#define SMIF_CACHE_BLOCK_NSECSTATCTRL_ENABLE_Pos 0UL
#define SMIF_CACHE_BLOCK_NSECSTATCTRL_ENABLE_Msk 0x1UL
#define SMIF_CACHE_BLOCK_NSECSTATCTRL_RESET_Pos 1UL
#define SMIF_CACHE_BLOCK_NSECSTATCTRL_RESET_Msk 0x2UL
/* SMIF_CACHE_BLOCK.PMSVR0 */
#define SMIF_CACHE_BLOCK_PMSVR0_SHCS_Pos        0UL
#define SMIF_CACHE_BLOCK_PMSVR0_SHCS_Msk        0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.PMSVR1 */
#define SMIF_CACHE_BLOCK_PMSVR1_SMCS_Pos        0UL
#define SMIF_CACHE_BLOCK_PMSVR1_SMCS_Msk        0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.PMSVR2 */
#define SMIF_CACHE_BLOCK_PMSVR2_NSHCS_Pos       0UL
#define SMIF_CACHE_BLOCK_PMSVR2_NSHCS_Msk       0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.PMSVR3 */
#define SMIF_CACHE_BLOCK_PMSVR3_NSMCS_Pos       0UL
#define SMIF_CACHE_BLOCK_PMSVR3_NSMCS_Msk       0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.PMSSSR */
#define SMIF_CACHE_BLOCK_PMSSSR_NC_Pos          0UL
#define SMIF_CACHE_BLOCK_PMSSSR_NC_Msk          0x1UL
/* SMIF_CACHE_BLOCK.PMSSCR */
#define SMIF_CACHE_BLOCK_PMSSCR_SS_Pos          0UL
#define SMIF_CACHE_BLOCK_PMSSCR_SS_Msk          0x1UL
/* SMIF_CACHE_BLOCK.PMSSRR */
#define SMIF_CACHE_BLOCK_PMSSRR_RP_SHC_Pos      0UL
#define SMIF_CACHE_BLOCK_PMSSRR_RP_SHC_Msk      0x1UL
#define SMIF_CACHE_BLOCK_PMSSRR_RP_SMC_Pos      1UL
#define SMIF_CACHE_BLOCK_PMSSRR_RP_SMC_Msk      0x2UL
#define SMIF_CACHE_BLOCK_PMSSRR_RP_NSHC_Pos     2UL
#define SMIF_CACHE_BLOCK_PMSSRR_RP_NSHC_Msk     0x4UL
#define SMIF_CACHE_BLOCK_PMSSRR_RP_NSMC_Pos     3UL
#define SMIF_CACHE_BLOCK_PMSSRR_RP_NSMC_Msk     0x8UL
/* SMIF_CACHE_BLOCK.PIDR4 */
#define SMIF_CACHE_BLOCK_PIDR4_DES_2_Pos        0UL
#define SMIF_CACHE_BLOCK_PIDR4_DES_2_Msk        0xFUL
#define SMIF_CACHE_BLOCK_PIDR4_SIZE_Pos         4UL
#define SMIF_CACHE_BLOCK_PIDR4_SIZE_Msk         0xF0UL
/* SMIF_CACHE_BLOCK.PIDR5 */
#define SMIF_CACHE_BLOCK_PIDR5_RSVD_Pos         0UL
#define SMIF_CACHE_BLOCK_PIDR5_RSVD_Msk         0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.PIDR6 */
#define SMIF_CACHE_BLOCK_PIDR6_RSVD_Pos         0UL
#define SMIF_CACHE_BLOCK_PIDR6_RSVD_Msk         0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.PIDR7 */
#define SMIF_CACHE_BLOCK_PIDR7_RSVD_Pos         0UL
#define SMIF_CACHE_BLOCK_PIDR7_RSVD_Msk         0xFFFFFFFFUL
/* SMIF_CACHE_BLOCK.PIDR0 */
#define SMIF_CACHE_BLOCK_PIDR0_PART_0_Pos       0UL
#define SMIF_CACHE_BLOCK_PIDR0_PART_0_Msk       0xFFUL
#define SMIF_CACHE_BLOCK_PIDR0_RES0_0_Pos       8UL
#define SMIF_CACHE_BLOCK_PIDR0_RES0_0_Msk       0xFFFFFF00UL
/* SMIF_CACHE_BLOCK.PIDR1 */
#define SMIF_CACHE_BLOCK_PIDR1_PART_1_Pos       0UL
#define SMIF_CACHE_BLOCK_PIDR1_PART_1_Msk       0xFUL
#define SMIF_CACHE_BLOCK_PIDR1_DES_0_Pos        4UL
#define SMIF_CACHE_BLOCK_PIDR1_DES_0_Msk        0xF0UL
/* SMIF_CACHE_BLOCK.PIDR2 */
#define SMIF_CACHE_BLOCK_PIDR2_DES_1_Pos        0UL
#define SMIF_CACHE_BLOCK_PIDR2_DES_1_Msk        0x7UL
#define SMIF_CACHE_BLOCK_PIDR2_JEDEC_Pos        3UL
#define SMIF_CACHE_BLOCK_PIDR2_JEDEC_Msk        0x8UL
#define SMIF_CACHE_BLOCK_PIDR2_REVISION_Pos     4UL
#define SMIF_CACHE_BLOCK_PIDR2_REVISION_Msk     0xF0UL
#define SMIF_CACHE_BLOCK_PIDR2_RES0_0_Pos       8UL
#define SMIF_CACHE_BLOCK_PIDR2_RES0_0_Msk       0xFFFFFF00UL
/* SMIF_CACHE_BLOCK.PIDR3 */
#define SMIF_CACHE_BLOCK_PIDR3_CMOD_Pos         0UL
#define SMIF_CACHE_BLOCK_PIDR3_CMOD_Msk         0xFUL
#define SMIF_CACHE_BLOCK_PIDR3_REVAND_Pos       4UL
#define SMIF_CACHE_BLOCK_PIDR3_REVAND_Msk       0xF0UL
/* SMIF_CACHE_BLOCK.CIDR0 */
#define SMIF_CACHE_BLOCK_CIDR0_PRMBL_0_Pos      0UL
#define SMIF_CACHE_BLOCK_CIDR0_PRMBL_0_Msk      0xFFUL
/* SMIF_CACHE_BLOCK.CIDR1 */
#define SMIF_CACHE_BLOCK_CIDR1_PRMBL_1_Pos      0UL
#define SMIF_CACHE_BLOCK_CIDR1_PRMBL_1_Msk      0xFUL
#define SMIF_CACHE_BLOCK_CIDR1_CLASS_Pos        4UL
#define SMIF_CACHE_BLOCK_CIDR1_CLASS_Msk        0xF0UL
/* SMIF_CACHE_BLOCK.CIDR2 */
#define SMIF_CACHE_BLOCK_CIDR2_PRMBL_2_Pos      0UL
#define SMIF_CACHE_BLOCK_CIDR2_PRMBL_2_Msk      0xFFUL
#define SMIF_CACHE_BLOCK_CIDR2_RES0_0_Pos       8UL
#define SMIF_CACHE_BLOCK_CIDR2_RES0_0_Msk       0xFFFFFF00UL
/* SMIF_CACHE_BLOCK.CIDR3 */
#define SMIF_CACHE_BLOCK_CIDR3_PRMBL_3_Pos      0UL
#define SMIF_CACHE_BLOCK_CIDR3_PRMBL_3_Msk      0xFFUL


/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_CMD */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Msk 0x1UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_ADDR */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_ADDR_ADDR_Pos 8UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_ADDR_ADDR_Msk 0xFFFFFF00UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_MASK */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_MASK_MASK_Pos 8UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_MASK_MASK_Msk 0xFFFFFF00UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_SUBREGION */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_SUBREGION_SUBREGION_DISABLE_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_SUBREGION_SUBREGION_DISABLE_Msk 0xFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT0 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_LSB_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_LSB_Msk 0xFUL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_MSB_Pos 4UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_MSB_Msk 0xFFFFFFF0UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT1 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT1_INPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT1_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT2 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT2_INPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT2_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT3 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT3_INPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT3_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY0 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY0_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY0_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY1 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY1_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY1_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY2 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY2_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY2_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY3 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY3_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY3_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT0 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT0_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT0_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT1 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT1_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT1_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT2 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT2_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT2_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT3 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT3_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT3_OUTPUT_Msk 0xFFFFFFFFUL


