PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v6.h
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.OUT */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_OUT7_Msk 0x80UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.OUT_CLR */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_CLR_OUT7_Msk 0x80UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.OUT_SET */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_SET_OUT7_Msk 0x80UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.OUT_INV */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_OUT_INV_OUT7_Msk 0x80UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.IN */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_IN7_Msk 0x80UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_FLT_IN_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_IN_FLT_IN_Msk 0x100UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.INTR */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_EDGE7_Msk 0x80UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_FLT_EDGE_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_FLT_EDGE_Msk 0x100UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN0_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN0_Msk 0x10000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN1_Pos 17UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN1_Msk 0x20000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN2_Pos 18UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN2_Msk 0x40000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN3_Pos 19UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN3_Msk 0x80000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN4_Pos 20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN4_Msk 0x100000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN5_Pos 21UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN5_Msk 0x200000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN6_Pos 22UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN6_Msk 0x400000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN7_Pos 23UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_IN_IN7_Msk 0x800000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_FLT_IN_IN_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_FLT_IN_IN_Msk 0x1000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.INTR_MASK */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_EDGE7_Msk 0x80UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_FLT_EDGE_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASK_FLT_EDGE_Msk 0x100UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.INTR_MASKED */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_EDGE7_Msk 0x80UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_FLT_EDGE_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_MASKED_FLT_EDGE_Msk 0x100UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.INTR_SET */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_EDGE7_Msk 0x80UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_FLT_EDGE_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_SET_FLT_EDGE_Msk 0x100UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.INTR_CFG */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE0_SEL_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE0_SEL_Msk 0x3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE1_SEL_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE1_SEL_Msk 0xCUL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE2_SEL_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE2_SEL_Msk 0x30UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE3_SEL_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE3_SEL_Msk 0xC0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE4_SEL_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE4_SEL_Msk 0x300UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE5_SEL_Pos 10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE5_SEL_Msk 0xC00UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE6_SEL_Pos 12UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE6_SEL_Msk 0x3000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE7_SEL_Pos 14UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_EDGE7_SEL_Msk 0xC000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_FLT_EDGE_SEL_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_FLT_EDGE_SEL_Msk 0x30000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_FLT_SEL_Pos 18UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_INTR_CFG_FLT_SEL_Msk 0x1C0000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE0_Msk 0x7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN0_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN0_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE1_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE1_Msk 0x70UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN1_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN1_Msk 0x80UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE2_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE2_Msk 0x700UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN2_Pos 11UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN2_Msk 0x800UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE3_Pos 12UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE3_Msk 0x7000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN3_Pos 15UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN3_Msk 0x8000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE4_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE4_Msk 0x70000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN4_Pos 19UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN4_Msk 0x80000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE5_Pos 20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE5_Msk 0x700000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN5_Pos 23UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN5_Msk 0x800000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE6_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE6_Msk 0x7000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN6_Pos 27UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN6_Msk 0x8000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE7_Pos 28UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_MODE7_Msk 0x70000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN7_Pos 31UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_EN7_Msk 0x80000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_IN */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL0_0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL0_0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL1_0_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL1_0_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL2_0_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL2_0_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL3_0_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL3_0_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL4_0_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL4_0_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL5_0_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL5_0_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL6_0_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL6_0_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL7_0_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_VTRIP_SEL7_0_Msk 0x80UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_OUT */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_SLOW7_Msk 0x80UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL0_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL0_Msk 0x30000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL1_Pos 18UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL1_Msk 0xC0000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL2_Pos 20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL2_Msk 0x300000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL3_Pos 22UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL3_Msk 0xC00000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL4_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL4_Msk 0x3000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL5_Pos 26UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL5_Msk 0xC000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL6_Pos 28UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL6_Msk 0x30000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL7_Pos 30UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT_DRIVE_SEL7_Msk 0xC0000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_SIO */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN01_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN01_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL01_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL01_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL01_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL01_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL01_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL01_Msk 0x18UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL01_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL01_Msk 0xE0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN23_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN23_Msk 0x100UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL23_Pos 9UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL23_Msk 0x200UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL23_Pos 10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL23_Msk 0x400UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL23_Pos 11UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL23_Msk 0x1800UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL23_Pos 13UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL23_Msk 0xE000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN45_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN45_Msk 0x10000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL45_Pos 17UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL45_Msk 0x20000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL45_Pos 18UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL45_Msk 0x40000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL45_Pos 19UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL45_Msk 0x180000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL45_Pos 21UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL45_Msk 0xE00000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN67_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREG_EN67_Msk 0x1000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL67_Pos 25UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_IBUF_SEL67_Msk 0x2000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL67_Pos 26UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VTRIP_SEL67_Msk 0x4000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL67_Pos 27UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VREF_SEL67_Msk 0x18000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL67_Pos 29UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SIO_VOH_SEL67_Msk 0xE0000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_IN_AUTOLVL */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL0_1_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL0_1_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL1_1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL1_1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL2_1_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL2_1_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL3_1_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL3_1_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL4_1_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL4_1_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL5_1_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL5_1_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL6_1_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL6_1_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL7_1_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_IN_AUTOLVL_VTRIP_SEL7_1_Msk 0x80UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_OUT2 */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM0_Msk 0x7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM1_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM1_Msk 0x38UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM2_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM2_Msk 0x1C0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM3_Pos 9UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM3_Msk 0xE00UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM4_Pos 12UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM4_Msk 0x7000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM5_Pos 15UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM5_Msk 0x38000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM6_Pos 18UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM6_Msk 0x1C0000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM7_Pos 21UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT2_DS_TRIM7_Msk 0xE00000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_SLEW_EXT */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW0_Msk 0x7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW1_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW1_Msk 0x70UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW2_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW2_Msk 0x700UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW3_Pos 12UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW3_Msk 0x7000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW4_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW4_Msk 0x70000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW5_Pos 20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW5_Msk 0x700000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW6_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW6_Msk 0x7000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW7_Pos 28UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_SLEW_EXT_SLEW7_Msk 0x70000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_DRIVE_EXT0 */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT0_Msk 0x1FUL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT1_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT1_Msk 0x1F00UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT2_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT2_Msk 0x1F0000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT3_Pos 24UL
