PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v6.h
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT3_Msk 0x1F000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_DRIVE_EXT1 */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT4_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT4_Msk 0x1FUL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT5_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT5_Msk 0x1F00UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT6_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT6_Msk 0x1F0000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT7_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT7_Msk 0x1F000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_OUT3 */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT0_Msk 0xFUL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT1_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT1_Msk 0xF0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT2_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT2_Msk 0xF00UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT3_Pos 12UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT3_Msk 0xF000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT4_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT4_Msk 0xF0000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT5_Pos 20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT5_Msk 0xF00000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT6_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT6_Msk 0xF000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT7_Pos 28UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_OUT3_DRIVEMODE_EXT7_Msk 0xF0000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.CFG_RES */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG0_Msk 0xFUL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG1_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG1_Msk 0xF0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG2_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG2_Msk 0xF00UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG3_Pos 12UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG3_Msk 0xF000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG4_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG4_Msk 0xF0000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG5_Pos 20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG5_Msk 0xF00000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG6_Pos 24UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG6_Msk 0xF000000UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG7_Pos 28UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_CFG_RES_RESISTOR_CFG7_Msk 0xF0000000UL
/* SMIF_CORE_SMIF_GPIO_SMIF_PRT.MSC_ANA */
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA0_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA0_Msk 0x1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA1_Pos 1UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA1_Msk 0x2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA2_Pos 2UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA2_Msk 0x4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA3_Pos 3UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA3_Msk 0x8UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA4_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA4_Msk 0x10UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA5_Pos 5UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA5_Msk 0x20UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA6_Pos 6UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA6_Msk 0x40UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA7_Pos 7UL
#define SMIF_CORE_SMIF_GPIO_SMIF_PRT_MSC_ANA_DATA7_Msk 0x80UL


/* SMIF_CORE_SMIF_GPIO.SEC_INTR_CAUSE0 */
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE0_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE0_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.SEC_INTR_CAUSE1 */
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE1_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE1_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.SEC_INTR_CAUSE2 */
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE2_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE2_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.SEC_INTR_CAUSE3 */
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE3_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_SEC_INTR_CAUSE3_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.INTR_CAUSE0 */
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE0_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE0_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.INTR_CAUSE1 */
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE1_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE1_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.INTR_CAUSE2 */
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE2_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE2_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.INTR_CAUSE3 */
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE3_PORT_INT_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_INTR_CAUSE3_PORT_INT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_GPIO.VDD_ACTIVE */
#define SMIF_CORE_SMIF_GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Msk 0xFFFFUL
#define SMIF_CORE_SMIF_GPIO_VDD_ACTIVE_VDDA_ACTIVE_Pos 30UL
#define SMIF_CORE_SMIF_GPIO_VDD_ACTIVE_VDDA_ACTIVE_Msk 0x40000000UL
#define SMIF_CORE_SMIF_GPIO_VDD_ACTIVE_VDDD_ACTIVE_Pos 31UL
#define SMIF_CORE_SMIF_GPIO_VDD_ACTIVE_VDDD_ACTIVE_Msk 0x80000000UL
/* SMIF_CORE_SMIF_GPIO.VDD_INTR */
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_VDDIO_ACTIVE_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_VDDIO_ACTIVE_Msk 0xFFFFUL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_VDDA_ACTIVE_Pos 30UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_VDDA_ACTIVE_Msk 0x40000000UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_VDDD_ACTIVE_Pos 31UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_VDDD_ACTIVE_Msk 0x80000000UL
/* SMIF_CORE_SMIF_GPIO.VDD_INTR_MASK */
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Msk 0xFFFFUL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Pos 30UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Msk 0x40000000UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Pos 31UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Msk 0x80000000UL
/* SMIF_CORE_SMIF_GPIO.VDD_INTR_MASKED */
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Msk 0xFFFFUL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Pos 30UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Msk 0x40000000UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Pos 31UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Msk 0x80000000UL
/* SMIF_CORE_SMIF_GPIO.VDD_INTR_SET */
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Msk 0xFFFFUL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_SET_VDDA_ACTIVE_Pos 30UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_SET_VDDA_ACTIVE_Msk 0x40000000UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_SET_VDDD_ACTIVE_Pos 31UL
#define SMIF_CORE_SMIF_GPIO_VDD_INTR_SET_VDDD_ACTIVE_Msk 0x80000000UL
/* SMIF_CORE_SMIF_GPIO.VDD_PWRSW_STATUS */
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_STATUS_PWROK_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_STATUS_PWROK_Msk 0x1UL
/* SMIF_CORE_SMIF_GPIO.VDD_PWRSW_CTL */
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_ILIM_Pos 0UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_ILIM_Msk 0x3UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_THRES_SEL_Pos 4UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_THRES_SEL_Msk 0x30UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_SW_ON_Pos 8UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_SW_ON_Msk 0x100UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_PWROK_BYPASS_Pos 9UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_PWROK_BYPASS_Msk 0x200UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_MODEHV_LOCK_Pos 16UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_MODEHV_LOCK_Msk 0xFF0000UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_MODEHV_Pos 31UL
#define SMIF_CORE_SMIF_GPIO_VDD_PWRSW_CTL_MODEHV_Msk 0x80000000UL


