PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v6.h
/* SMIF_CORE.CTL */
#define SMIF_CORE_CTL_XIP_MODE_Pos              0UL
#define SMIF_CORE_CTL_XIP_MODE_Msk              0x1UL
#define SMIF_CORE_CTL_DESELECT_DELAY_Pos        16UL
#define SMIF_CORE_CTL_DESELECT_DELAY_Msk        0x70000UL
#define SMIF_CORE_CTL_SELECT_SETUP_DELAY_Pos    20UL
#define SMIF_CORE_CTL_SELECT_SETUP_DELAY_Msk    0x300000UL
#define SMIF_CORE_CTL_SELECT_HOLD_DELAY_Pos     22UL
#define SMIF_CORE_CTL_SELECT_HOLD_DELAY_Msk     0xC00000UL
#define SMIF_CORE_CTL_BLOCK_Pos                 24UL
#define SMIF_CORE_CTL_BLOCK_Msk                 0x1000000UL
#define SMIF_CORE_CTL_CLOCK_IF_SEL_Pos          25UL
#define SMIF_CORE_CTL_CLOCK_IF_SEL_Msk          0x2000000UL
#define SMIF_CORE_CTL_ENABLED_Pos               31UL
#define SMIF_CORE_CTL_ENABLED_Msk               0x80000000UL
/* SMIF_CORE.STATUS */
#define SMIF_CORE_STATUS_DLL_LOCKED_Pos         0UL
#define SMIF_CORE_STATUS_DLL_LOCKED_Msk         0x1UL
#define SMIF_CORE_STATUS_BUSY_Pos               31UL
#define SMIF_CORE_STATUS_BUSY_Msk               0x80000000UL
/* SMIF_CORE.CTL2 */
#define SMIF_CORE_CTL2_DLL_SPEED_MODE_Pos       0UL
#define SMIF_CORE_CTL2_DLL_SPEED_MODE_Msk       0x3UL
#define SMIF_CORE_CTL2_DLL_OPENLOOP_ENABLE_Pos  2UL
#define SMIF_CORE_CTL2_DLL_OPENLOOP_ENABLE_Msk  0x4UL
#define SMIF_CORE_CTL2_DLL_BYPASS_MODE_Pos      3UL
#define SMIF_CORE_CTL2_DLL_BYPASS_MODE_Msk      0x8UL
#define SMIF_CORE_CTL2_CLKOUT_DIV_Pos           4UL
#define SMIF_CORE_CTL2_CLKOUT_DIV_Msk           0x30UL
#define SMIF_CORE_CTL2_DLL_MDL_BYPASS_MODE_Pos  6UL
#define SMIF_CORE_CTL2_DLL_MDL_BYPASS_MODE_Msk  0x40UL
#define SMIF_CORE_CTL2_DLL_IGNORE_LOCK_Pos      7UL
#define SMIF_CORE_CTL2_DLL_IGNORE_LOCK_Msk      0x80UL
#define SMIF_CORE_CTL2_MDL_TAP_SEL_Pos          8UL
#define SMIF_CORE_CTL2_MDL_TAP_SEL_Msk          0xF00UL
#define SMIF_CORE_CTL2_DLL_GATING_PERIOD_Pos    12UL
#define SMIF_CORE_CTL2_DLL_GATING_PERIOD_Msk    0x7000UL
#define SMIF_CORE_CTL2_DLL_UNLOCK_VALUE_Pos     15UL
#define SMIF_CORE_CTL2_DLL_UNLOCK_VALUE_Msk     0x38000UL
#define SMIF_CORE_CTL2_DLL_SKIP_LSB_Pos         18UL
#define SMIF_CORE_CTL2_DLL_SKIP_LSB_Msk         0xC0000UL
#define SMIF_CORE_CTL2_RX_CAPTURE_MODE_Pos      20UL
#define SMIF_CORE_CTL2_RX_CAPTURE_MODE_Msk      0x300000UL
#define SMIF_CORE_CTL2_RX_CHASE_MARGIN_Pos      22UL
#define SMIF_CORE_CTL2_RX_CHASE_MARGIN_Msk      0xC00000UL
#define SMIF_CORE_CTL2_TX_SDR_EXTRA_SETUP_Pos   31UL
#define SMIF_CORE_CTL2_TX_SDR_EXTRA_SETUP_Msk   0x80000000UL
/* SMIF_CORE.DLP_DELAY_TAP_SEL0 */
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT0_TAP_SEL_Pos 0UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT0_TAP_SEL_Msk 0xFFUL
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT1_TAP_SEL_Pos 8UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT1_TAP_SEL_Msk 0xFF00UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT2_TAP_SEL_Pos 16UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT2_TAP_SEL_Msk 0xFF0000UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT3_TAP_SEL_Pos 24UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT3_TAP_SEL_Msk 0xFF000000UL
/* SMIF_CORE.DLP_DELAY_TAP_SEL1 */
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT4_TAP_SEL_Pos 0UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT4_TAP_SEL_Msk 0xFFUL
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT5_TAP_SEL_Pos 8UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT5_TAP_SEL_Msk 0xFF00UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT6_TAP_SEL_Pos 16UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT6_TAP_SEL_Msk 0xFF0000UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT7_TAP_SEL_Pos 24UL
#define SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT7_TAP_SEL_Msk 0xFF000000UL
/* SMIF_CORE.DLP_CTL */
#define SMIF_CORE_DLP_CTL_DLP_Pos               0UL
#define SMIF_CORE_DLP_CTL_DLP_Msk               0xFFFFUL
#define SMIF_CORE_DLP_CTL_DLP_SIZE_Pos          16UL
#define SMIF_CORE_DLP_CTL_DLP_SIZE_Msk          0xF0000UL
#define SMIF_CORE_DLP_CTL_DLP_WARNING_LEVEL_Pos 24UL
#define SMIF_CORE_DLP_CTL_DLP_WARNING_LEVEL_Msk 0xF000000UL
/* SMIF_CORE.DLP_STATUS0 */
#define SMIF_CORE_DLP_STATUS0_DATA_BIT0_Pos     0UL
#define SMIF_CORE_DLP_STATUS0_DATA_BIT0_Msk     0x1FUL
#define SMIF_CORE_DLP_STATUS0_DATA_BIT1_Pos     8UL
#define SMIF_CORE_DLP_STATUS0_DATA_BIT1_Msk     0x1F00UL
#define SMIF_CORE_DLP_STATUS0_DATA_BIT2_Pos     16UL
#define SMIF_CORE_DLP_STATUS0_DATA_BIT2_Msk     0x1F0000UL
#define SMIF_CORE_DLP_STATUS0_DATA_BIT3_Pos     24UL
#define SMIF_CORE_DLP_STATUS0_DATA_BIT3_Msk     0x1F000000UL
/* SMIF_CORE.DLP_STATUS1 */
#define SMIF_CORE_DLP_STATUS1_DATA_BIT4_Pos     0UL
#define SMIF_CORE_DLP_STATUS1_DATA_BIT4_Msk     0x1FUL
#define SMIF_CORE_DLP_STATUS1_DATA_BIT5_Pos     8UL
#define SMIF_CORE_DLP_STATUS1_DATA_BIT5_Msk     0x1F00UL
#define SMIF_CORE_DLP_STATUS1_DATA_BIT6_Pos     16UL
#define SMIF_CORE_DLP_STATUS1_DATA_BIT6_Msk     0x1F0000UL
#define SMIF_CORE_DLP_STATUS1_DATA_BIT7_Pos     24UL
#define SMIF_CORE_DLP_STATUS1_DATA_BIT7_Msk     0x1F000000UL
/* SMIF_CORE.TX_CMD_FIFO_STATUS */
#define SMIF_CORE_TX_CMD_FIFO_STATUS_USED4_Pos  0UL
#define SMIF_CORE_TX_CMD_FIFO_STATUS_USED4_Msk  0xFUL
/* SMIF_CORE.TX_CMD_MMIO_FIFO_STATUS */
#define SMIF_CORE_TX_CMD_MMIO_FIFO_STATUS_USED4_Pos 0UL
#define SMIF_CORE_TX_CMD_MMIO_FIFO_STATUS_USED4_Msk 0xFUL
/* SMIF_CORE.TX_CMD_MMIO_FIFO_WR */
#define SMIF_CORE_TX_CMD_MMIO_FIFO_WR_DATA27_Pos 0UL
#define SMIF_CORE_TX_CMD_MMIO_FIFO_WR_DATA27_Msk 0x7FFFFFFUL
/* SMIF_CORE.TX_DATA_MMIO_FIFO_CTL */
#define SMIF_CORE_TX_DATA_MMIO_FIFO_CTL_TX_TRIGGER_LEVEL_Pos 0UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_CTL_TX_TRIGGER_LEVEL_Msk 0x7UL
/* SMIF_CORE.TX_DATA_FIFO_STATUS */
#define SMIF_CORE_TX_DATA_FIFO_STATUS_USED4_Pos 0UL
#define SMIF_CORE_TX_DATA_FIFO_STATUS_USED4_Msk 0xFUL
/* SMIF_CORE.TX_DATA_MMIO_FIFO_STATUS */
#define SMIF_CORE_TX_DATA_MMIO_FIFO_STATUS_USED4_Pos 0UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_STATUS_USED4_Msk 0xFUL
/* SMIF_CORE.TX_DATA_MMIO_FIFO_WR1 */
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR1_DATA0_Pos 0UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR1_DATA0_Msk 0xFFUL
/* SMIF_CORE.TX_DATA_MMIO_FIFO_WR2 */
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR2_DATA0_Pos 0UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR2_DATA0_Msk 0xFFUL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR2_DATA1_Pos 8UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR2_DATA1_Msk 0xFF00UL
/* SMIF_CORE.TX_DATA_MMIO_FIFO_WR4 */
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA0_Pos 0UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA0_Msk 0xFFUL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA1_Pos 8UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA1_Msk 0xFF00UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA2_Pos 16UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA2_Msk 0xFF0000UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA3_Pos 24UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR4_DATA3_Msk 0xFF000000UL
/* SMIF_CORE.TX_DATA_MMIO_FIFO_WR1ODD */
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR1ODD_DATA0_Pos 0UL
#define SMIF_CORE_TX_DATA_MMIO_FIFO_WR1ODD_DATA0_Msk 0xFFUL
/* SMIF_CORE.RX_DATA_MMIO_FIFO_CTL */
#define SMIF_CORE_RX_DATA_MMIO_FIFO_CTL_RX_TRIGGER_LEVEL_Pos 0UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_CTL_RX_TRIGGER_LEVEL_Msk 0x7UL
/* SMIF_CORE.RX_DATA_MMIO_FIFO_STATUS */
#define SMIF_CORE_RX_DATA_MMIO_FIFO_STATUS_USED4_Pos 0UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_STATUS_USED4_Msk 0xFUL
/* SMIF_CORE.RX_DATA_FIFO_STATUS */
#define SMIF_CORE_RX_DATA_FIFO_STATUS_USED4_Pos 0UL
#define SMIF_CORE_RX_DATA_FIFO_STATUS_USED4_Msk 0xFUL
#define SMIF_CORE_RX_DATA_FIFO_STATUS_RX_SR_USED_Pos 8UL
#define SMIF_CORE_RX_DATA_FIFO_STATUS_RX_SR_USED_Msk 0x100UL
/* SMIF_CORE.RX_DATA_MMIO_FIFO_RD1 */
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD1_DATA0_Pos 0UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD1_DATA0_Msk 0xFFUL
/* SMIF_CORE.RX_DATA_MMIO_FIFO_RD2 */
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD2_DATA0_Pos 0UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD2_DATA0_Msk 0xFFUL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD2_DATA1_Pos 8UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD2_DATA1_Msk 0xFF00UL
/* SMIF_CORE.RX_DATA_MMIO_FIFO_RD4 */
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA0_Pos 0UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA0_Msk 0xFFUL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA1_Pos 8UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA1_Msk 0xFF00UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA2_Pos 16UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA2_Msk 0xFF0000UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA3_Pos 24UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD4_DATA3_Msk 0xFF000000UL
/* SMIF_CORE.RX_DATA_MMIO_FIFO_RD1_SILENT */
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD1_SILENT_DATA0_Pos 0UL
#define SMIF_CORE_RX_DATA_MMIO_FIFO_RD1_SILENT_DATA0_Msk 0xFFUL
/* SMIF_CORE.SLOW_CA_CTL */
#define SMIF_CORE_SLOW_CA_CTL_WAY_Pos           16UL
#define SMIF_CORE_SLOW_CA_CTL_WAY_Msk           0x30000UL
#define SMIF_CORE_SLOW_CA_CTL_SET_ADDR_Pos      24UL
#define SMIF_CORE_SLOW_CA_CTL_SET_ADDR_Msk      0x3000000UL
#define SMIF_CORE_SLOW_CA_CTL_PREF_EN_Pos       30UL
#define SMIF_CORE_SLOW_CA_CTL_PREF_EN_Msk       0x40000000UL
#define SMIF_CORE_SLOW_CA_CTL_ENABLED_Pos       31UL
#define SMIF_CORE_SLOW_CA_CTL_ENABLED_Msk       0x80000000UL
/* SMIF_CORE.SLOW_CA_CMD */
#define SMIF_CORE_SLOW_CA_CMD_INV_Pos           0UL
#define SMIF_CORE_SLOW_CA_CMD_INV_Msk           0x1UL
/* SMIF_CORE.FAST_CA_CTL */
#define SMIF_CORE_FAST_CA_CTL_WAY_Pos           16UL
#define SMIF_CORE_FAST_CA_CTL_WAY_Msk           0x30000UL
#define SMIF_CORE_FAST_CA_CTL_SET_ADDR_Pos      24UL
#define SMIF_CORE_FAST_CA_CTL_SET_ADDR_Msk      0x3000000UL
#define SMIF_CORE_FAST_CA_CTL_PREF_EN_Pos       30UL
#define SMIF_CORE_FAST_CA_CTL_PREF_EN_Msk       0x40000000UL
#define SMIF_CORE_FAST_CA_CTL_ENABLED_Pos       31UL
#define SMIF_CORE_FAST_CA_CTL_ENABLED_Msk       0x80000000UL
/* SMIF_CORE.FAST_CA_CMD */
#define SMIF_CORE_FAST_CA_CMD_INV_Pos           0UL
#define SMIF_CORE_FAST_CA_CMD_INV_Msk           0x1UL
/* SMIF_CORE.CRC_CMD */
#define SMIF_CORE_CRC_CMD_START_Pos             0UL
#define SMIF_CORE_CRC_CMD_START_Msk             0x1UL
#define SMIF_CORE_CRC_CMD_CONTINUE_Pos          1UL
#define SMIF_CORE_CRC_CMD_CONTINUE_Msk          0x2UL
/* SMIF_CORE.CRC_INPUT0 */
#define SMIF_CORE_CRC_INPUT0_INPUT_Pos          0UL
#define SMIF_CORE_CRC_INPUT0_INPUT_Msk          0xFFFFFFFFUL
/* SMIF_CORE.CRC_INPUT1 */
#define SMIF_CORE_CRC_INPUT1_INPUT_Pos          0UL
#define SMIF_CORE_CRC_INPUT1_INPUT_Msk          0xFFFFFFFFUL
/* SMIF_CORE.CRC_OUTPUT */
#define SMIF_CORE_CRC_OUTPUT_CRC_OUTPUT_Pos     0UL
#define SMIF_CORE_CRC_OUTPUT_CRC_OUTPUT_Msk     0xFFUL
/* SMIF_CORE.INTR */
#define SMIF_CORE_INTR_TR_TX_REQ_Pos            0UL
#define SMIF_CORE_INTR_TR_TX_REQ_Msk            0x1UL
#define SMIF_CORE_INTR_TR_RX_REQ_Pos            1UL
#define SMIF_CORE_INTR_TR_RX_REQ_Msk            0x2UL
#define SMIF_CORE_INTR_XIP_ALIGNMENT_ERROR_Pos  2UL
#define SMIF_CORE_INTR_XIP_ALIGNMENT_ERROR_Msk  0x4UL
#define SMIF_CORE_INTR_TX_CMD_FIFO_OVERFLOW_Pos 3UL
#define SMIF_CORE_INTR_TX_CMD_FIFO_OVERFLOW_Msk 0x8UL
#define SMIF_CORE_INTR_TX_DATA_FIFO_OVERFLOW_Pos 4UL
#define SMIF_CORE_INTR_TX_DATA_FIFO_OVERFLOW_Msk 0x10UL
#define SMIF_CORE_INTR_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_CORE_INTR_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_CORE_INTR_DLP_FAIL_Pos             8UL
#define SMIF_CORE_INTR_DLP_FAIL_Msk             0x100UL
#define SMIF_CORE_INTR_DLP_WARNING_Pos          12UL
#define SMIF_CORE_INTR_DLP_WARNING_Msk          0x1000UL
#define SMIF_CORE_INTR_DLL_LOCK_Pos             13UL
#define SMIF_CORE_INTR_DLL_LOCK_Msk             0x2000UL
#define SMIF_CORE_INTR_DLL_UNLOCK_Pos           14UL
#define SMIF_CORE_INTR_DLL_UNLOCK_Msk           0x4000UL
#define SMIF_CORE_INTR_CRC_ERROR_Pos            16UL
#define SMIF_CORE_INTR_CRC_ERROR_Msk            0x10000UL
#define SMIF_CORE_INTR_FS_STATUS_ERROR_Pos      17UL
#define SMIF_CORE_INTR_FS_STATUS_ERROR_Msk      0x20000UL
/* SMIF_CORE.INTR_SET */
#define SMIF_CORE_INTR_SET_TR_TX_REQ_Pos        0UL
#define SMIF_CORE_INTR_SET_TR_TX_REQ_Msk        0x1UL
#define SMIF_CORE_INTR_SET_TR_RX_REQ_Pos        1UL
#define SMIF_CORE_INTR_SET_TR_RX_REQ_Msk        0x2UL
#define SMIF_CORE_INTR_SET_XIP_ALIGNMENT_ERROR_Pos 2UL
#define SMIF_CORE_INTR_SET_XIP_ALIGNMENT_ERROR_Msk 0x4UL
#define SMIF_CORE_INTR_SET_TX_CMD_FIFO_OVERFLOW_Pos 3UL
#define SMIF_CORE_INTR_SET_TX_CMD_FIFO_OVERFLOW_Msk 0x8UL
#define SMIF_CORE_INTR_SET_TX_DATA_FIFO_OVERFLOW_Pos 4UL
#define SMIF_CORE_INTR_SET_TX_DATA_FIFO_OVERFLOW_Msk 0x10UL
#define SMIF_CORE_INTR_SET_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_CORE_INTR_SET_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_CORE_INTR_SET_DLP_FAIL_Pos         8UL
#define SMIF_CORE_INTR_SET_DLP_FAIL_Msk         0x100UL
#define SMIF_CORE_INTR_SET_DLP_WARNING_Pos      12UL
#define SMIF_CORE_INTR_SET_DLP_WARNING_Msk      0x1000UL
#define SMIF_CORE_INTR_SET_DLL_LOCK_Pos         13UL
#define SMIF_CORE_INTR_SET_DLL_LOCK_Msk         0x2000UL
#define SMIF_CORE_INTR_SET_DLL_UNLOCK_Pos       14UL
#define SMIF_CORE_INTR_SET_DLL_UNLOCK_Msk       0x4000UL
#define SMIF_CORE_INTR_SET_CRC_ERROR_Pos        16UL
#define SMIF_CORE_INTR_SET_CRC_ERROR_Msk        0x10000UL
#define SMIF_CORE_INTR_SET_FS_STATUS_ERROR_Pos  17UL
#define SMIF_CORE_INTR_SET_FS_STATUS_ERROR_Msk  0x20000UL
/* SMIF_CORE.INTR_MASK */
#define SMIF_CORE_INTR_MASK_TR_TX_REQ_Pos       0UL
#define SMIF_CORE_INTR_MASK_TR_TX_REQ_Msk       0x1UL
#define SMIF_CORE_INTR_MASK_TR_RX_REQ_Pos       1UL
#define SMIF_CORE_INTR_MASK_TR_RX_REQ_Msk       0x2UL
#define SMIF_CORE_INTR_MASK_XIP_ALIGNMENT_ERROR_Pos 2UL
#define SMIF_CORE_INTR_MASK_XIP_ALIGNMENT_ERROR_Msk 0x4UL
#define SMIF_CORE_INTR_MASK_TX_CMD_FIFO_OVERFLOW_Pos 3UL
#define SMIF_CORE_INTR_MASK_TX_CMD_FIFO_OVERFLOW_Msk 0x8UL
#define SMIF_CORE_INTR_MASK_TX_DATA_FIFO_OVERFLOW_Pos 4UL
#define SMIF_CORE_INTR_MASK_TX_DATA_FIFO_OVERFLOW_Msk 0x10UL
#define SMIF_CORE_INTR_MASK_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_CORE_INTR_MASK_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_CORE_INTR_MASK_DLP_FAIL_Pos        8UL
#define SMIF_CORE_INTR_MASK_DLP_FAIL_Msk        0x100UL
#define SMIF_CORE_INTR_MASK_DLP_WARNING_Pos     12UL
#define SMIF_CORE_INTR_MASK_DLP_WARNING_Msk     0x1000UL
#define SMIF_CORE_INTR_MASK_DLL_LOCK_Pos        13UL
#define SMIF_CORE_INTR_MASK_DLL_LOCK_Msk        0x2000UL
#define SMIF_CORE_INTR_MASK_DLL_UNLOCK_Pos      14UL
#define SMIF_CORE_INTR_MASK_DLL_UNLOCK_Msk      0x4000UL
#define SMIF_CORE_INTR_MASK_CRC_ERROR_Pos       16UL
#define SMIF_CORE_INTR_MASK_CRC_ERROR_Msk       0x10000UL
#define SMIF_CORE_INTR_MASK_FS_STATUS_ERROR_Pos 17UL
#define SMIF_CORE_INTR_MASK_FS_STATUS_ERROR_Msk 0x20000UL
/* SMIF_CORE.INTR_MASKED */
#define SMIF_CORE_INTR_MASKED_TR_TX_REQ_Pos     0UL
#define SMIF_CORE_INTR_MASKED_TR_TX_REQ_Msk     0x1UL
#define SMIF_CORE_INTR_MASKED_TR_RX_REQ_Pos     1UL
#define SMIF_CORE_INTR_MASKED_TR_RX_REQ_Msk     0x2UL
#define SMIF_CORE_INTR_MASKED_XIP_ALIGNMENT_ERROR_Pos 2UL
#define SMIF_CORE_INTR_MASKED_XIP_ALIGNMENT_ERROR_Msk 0x4UL
#define SMIF_CORE_INTR_MASKED_TX_CMD_FIFO_OVERFLOW_Pos 3UL
#define SMIF_CORE_INTR_MASKED_TX_CMD_FIFO_OVERFLOW_Msk 0x8UL
#define SMIF_CORE_INTR_MASKED_TX_DATA_FIFO_OVERFLOW_Pos 4UL
#define SMIF_CORE_INTR_MASKED_TX_DATA_FIFO_OVERFLOW_Msk 0x10UL
#define SMIF_CORE_INTR_MASKED_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_CORE_INTR_MASKED_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_CORE_INTR_MASKED_DLP_FAIL_Pos      8UL
#define SMIF_CORE_INTR_MASKED_DLP_FAIL_Msk      0x100UL
#define SMIF_CORE_INTR_MASKED_DLP_WARNING_Pos   12UL
#define SMIF_CORE_INTR_MASKED_DLP_WARNING_Msk   0x1000UL
#define SMIF_CORE_INTR_MASKED_DLL_LOCK_Pos      13UL
#define SMIF_CORE_INTR_MASKED_DLL_LOCK_Msk      0x2000UL
#define SMIF_CORE_INTR_MASKED_DLL_UNLOCK_Pos    14UL
#define SMIF_CORE_INTR_MASKED_DLL_UNLOCK_Msk    0x4000UL
#define SMIF_CORE_INTR_MASKED_CRC_ERROR_Pos     16UL
#define SMIF_CORE_INTR_MASKED_CRC_ERROR_Msk     0x10000UL
#define SMIF_CORE_INTR_MASKED_FS_STATUS_ERROR_Pos 17UL
#define SMIF_CORE_INTR_MASKED_FS_STATUS_ERROR_Msk 0x20000UL
/* SMIF_CORE.DLL_IDAC */
#define SMIF_CORE_DLL_IDAC_SEL_Pos              0UL
#define SMIF_CORE_DLL_IDAC_SEL_Msk              0xFFFUL
/* SMIF_CORE.DLL_IVR */
#define SMIF_CORE_DLL_IVR_SELECT_Pos            0UL
#define SMIF_CORE_DLL_IVR_SELECT_Msk            0x7UL


#endif /* _CYIP_SMIF_V6_H_ */


/* [] END OF FILE */
